const regions = {
	"서울특별시": {
	       "강남구": [
	           "강남동", "논현동", "삼성동", "서초동", "역삼동", "청담동", "신사동", "도곡동", 
	           "대치동", "개포동", "일원동", "세곡동", "자곡동", "압구정동"
	       ],
	       "강동구": [
	           "천호동", "성내동", "길동", "암사동", "명일동", "고덕동", "둔촌동", "상일동", "강일동"
	       ],
	       "강북구": [
	           "수유동", "번동", "미아동", "인수동", "삼각지", "북서울꿈의숲", "우이동"
	       ],
	       "강서구": [
	           "등촌동", "화곡동", "가양동", "염창동", "발산동", "방화동", "내발산동", "공항동", "마곡동"
	       ],
	       "관악구": [
	           "신림동", "봉천동", "서울대입구", "난향동", "남현동", "조원동", "성현동", "청림동", "대학동"
	       ],
	       "광진구": [
	           "구의동", "자양동", "광장동", "중곡동", "능동", "송정동", "화양동"
	       ],
	       "구로구": [
	           "고척동", "개봉동", "가리봉동", "궁동", "천왕동", "오류동", "신도림동", "구로동"
	       ],
	       "금천구": [
	           "독산동", "시흥동", "가산동"
	       ],
	       "노원구": [
	           "상계동", "중계동", "하계동", "공릉동", "월계동", "태릉동", "미아동"
	       ],
	       "도봉구": [
	           "도봉동", "방학동", "창동", "쌍문동", "월계동"
	       ],
	       "동대문구": [
	           "제기동", "청량리동", "답십리동", "장안동", "휘경동", "이문동"
	       ],
	       "동작구": [
	           "상도동", "노량진동", "사당동", "대방동", "본동"
	       ],
	       "마포구": [
	           "합정동", "상수동", "망원동", "홍대입구", "연남동", "신촌", "서교동", "아현동"
	       ],
	       "서대문구": [
	           "신촌동", "북아현동", "남가좌동", "북가좌동", "홍제동", "천연동"
	       ],
	       "서초구": [
	           "서초동", "반포동", "양재동", "방배동", "내곡동", "우면동", "염곡동"
	       ],
	       "성동구": [
	           "성수동", "옥수동", "예장동", "왕십리", "행당동"
	       ],
	       "성북구": [
	           "성북동", "안암동", "길음동", "장위동", "정릉동", "보문동"
	       ],
	       "송파구": [
	           "잠실동", "송파동", "가락동", "문정동", "석촌동", "방이동", "오금동"
	       ],
	       "양천구": [
	           "목동", "신정동", "신월동", "가양동", "양천향교"
	       ],
	       "영등포구": [
	           "여의도", "영등포동", "당산동", "문래동", "대림동"
	       ],
	       "용산구": [
	           "한남동", "이태원동", "용산동", "후암동", "원효로", "남영동"
	       ],
	       "은평구": [
	           "불광동", "응암동", "갈현동", "수색동", "녹번동"
	       ],
	       "종로구": [
	           "종로1가", "종로2가", "종로3가", "종로4가", "세종로", "청운효자동", "교북동", "돈의동"
	       ],
	       "중구": [
	           "소공동", "회현동", "필동", "장충동", "광희동", "중림동", "약수동", "동대문"
	       ],
	       "중랑구": [
	           "면목동", "상봉동", "중화동", "묵동", "망우동", "신내동"
	       ]
	   },
    "부산광역시": {
		"강서구": [
		        "강동동", "강서동", "대저1동", "대저2동", "송정동", "공항동", "지사동"
		    ],
		    "금정구": [
		        "금사동", "금성동", "남산동", "구서동", "회동동", "부곡동", "장전동", "범천동"
		    ],
		    "기장군": [
		        "기장읍", "장안읍", "정관읍", "철마면", "고촌면"
		    ],
		    "남구": [
		        "대연동", "용호동", "감만동", "문현동", "수영동", "아미동", "삼호동", "해운대동"
		    ],
		    "동구": [
		        "좌천동", "초량동", "범일동", "송정동", "수정동"
		    ],
		    "동래구": [
		        "온천동", "복천동", "명장동", "수안동", "사직동", "성내동"
		    ],
		    "부산진구": [
		        "부산진동", "범천동", "연지동", "양정동", "전포동", "부암동", "동성로", "가야동"
		    ],
		    "북구": [
		        "만덕동", "구포동", "금곡동", "덕천동", "사상동", "송정동"
		    ],
		    "사상구": [
		        "엄궁동", "감전동", "학장동", "괘법동", "덕포동"
		    ],
		    "사하구": [
		        "하단동", "괴정동", "장림동", "신평동", "다대동"
		    ],
		    "서구": [
		        "동대신동", "서대신동", "토성동", "부민동"
		    ],
		    "수영구": [
		        "민락동", "남천동", "수영동", "광안동", "송정동"
		    ],
		    "연제구": [
		        "거제동", "연산동", "연제동", "봉계동"
		    ],
		    "영도구": [
		        "영선동", "동삼동", "봉래동", "태종대동"
		    ],
		    "중구": [
		        "중앙동", "남포동", "광복동", "대청동", "동광동"
		    ],
		    "해운대구": [
		        "우동", "좌동", "송정동", "중동", "반송동"
		    ]
	},
    "대구광역시": {
		"남구": [
		        "대명동", "봉덕동", "이천동", "복현동", "침산동", "고산동", "서문동", "신천동"
		    ],
		    "달서구": [
		        "두류동", "본리동", "상인동", "파호동", "용산동", "월성동", "갈산동", "송현동"
		    ],
		    "달성군": [
		        "논공읍", "옥포읍", "화원읍", "다사읍", "유가읍", "가창면", "현풍면"
		    ],
		    "동구": [
		        "방촌동", "신천동", "매천동", "각산동", "지묘동", "효목동", "동호동"
		    ],
		    "북구": [
		        "침산동", "동호동", "구암동", "노원동", "대현동", "태전동", "관음동"
		    ],
		    "서구": [
		        "평리동", "원대동", "내당동", "비산동", "화원동", "괴전동", "내서동"
		    ],
		    "수성구": [
		        "수성동", "범어동", "고산동", "황금동", "대흥동", "파동", "두산동", "중동"
		    ],
		    "중구": [
		        "남산동", "동인동", "성내동", "대봉동", "대신동", "신암동", "북성로"
		    ]
	},
    "인천광역시": {
		"강화군": [
		        "강화읍", "길상면", "불은면", "삼산면", "서도면", "선원면", "양도면", "양사면",
		        "옹진면", "청천면", "화도면"
		    ],
		    "계양구": [
		        "작전동", "이화동", "병방동", "효성동", "계산동", "갈산동", "귤현동"
		    ],
		    "남동구": [
		        "구월동", "간석동", "서창동", "논현동", "남촌동", "만수동", "장수동", "진건동"
		    ],
		    "동구": [
		        "송현동", "금창동", "금호동", "화수동", "청학동", "마전동"
		    ],
		    "미추홀구": [
		        "학익동", "용현동", "주안동", "도화동", "문학동", "숭의동"
		    ],
		    "부평구": [
		        "삼산동", "부평동", "청천동", "산곡동", "갈산동", "십정동", "부평3동", "십정2동"
		    ],
		    "서구": [
		        "가좌동", "검암동", "석남동", "원당동", "오류동", "마전동", "당하동"
		    ],
		    "연수구": [
		        "송도동", "연수동", "청학동", "옥련동", "선학동", "동춘동", "구월동"
		    ],
		    "옹진군": [
		        "영흥면", "소야면", "교동면", "백령면", "대청면"
		    ]
	},
    "광주광역시": {
		"광산구": [
		        "우산동", "임곡동", "송정동", "북구", "운남동", "쌍암동", "광산동"
		    ],
		    "남구": [
		        "주월동", "효덕동", "방림동", "도산동", "월산동", "동명동", "대촌동"
		    ],
		    "동구": [
		        "광산동", "학동", "계림동", "충장로", "충장동", "서석동"
		    ],
		    "북구": [
		        "양산동", "본촌동", "운암동", "동림동", "임동", "연제동"
		    ],
		    "서구": [
		        "상무동", "치평동", "광천동", "염주동", "내방동", "쌍촌동"
		    ]
	},
    "대전광역시": {
		"대덕구": [
		        "덕암동", "법1동", "법2동", "비래동", "송촌동", "원동", "중리동", "대화동"
		    ],
		    "동구": [
		        "가양동", "대동", "원내동", "중리동", "청사동", "금산동", "정동", "용운동"
		    ],
		    "서구": [
		        "갈마동", "둔산동", "도마동", "월평동", "정림동", "청사동", "용문동", "오류동"
		    ],
		    "유성구": [
		        "궁동", "구암동", "금고동", "노은동", "신성동", "학하동", "용계동", "지족동"
		    ],
		    "중구": [
		        "문화동", "목동", "태평동", "용두동", "선화동", "은행동", "석교동", "광장동"
		    ]
	},
    "울산광역시": {
		"남구": [
		        "달동", "대송동", "도산동", "삼산동", "성암동", "신정동", "여천동", "옥동", "용연동"
		    ],
		    "동구": [
		        "방어동", "봉계동", "원동", "일산동", "주전동", "중리동", "화정동"
		    ],
		    "북구": [
		        "강동", "매곡동", "명촌동", "삼산동", "송정동", "오토밸리", "장생포동", "중산동"
		    ],
		    "울주군": [
		        "두서면", "두동면", "온양읍", "울주면", "청량읍", "삼남면", "상북면"
		    ],
		    "중구": [
		        "약사동", "태화동", "성안동", "동동", "문화동", "교동", "복산동"
		    ]
	},
    "경기도": {
		"가평군": [
		        "가평읍", "북면", "설악면", "조종면", "청평면", "상면", "조종면"
		    ],
		    "고양시": [
		        "덕양구", "일산동구", "일산서구"
		    ],
		    "과천시": [
		        "과천동", "문원동", "부림동", "별양동"
		    ],
		    "광명시": [
		        "광명동", "소하동", "철산동", "하안동", "금천동"
		    ],
		    "광주시": [
		        "경안동", "광남동", "초월면", "태전동", "행정동"
		    ],
		    "구리시": [
		        "수택동", "인창동", "갈매동", "교문동"
		    ],
		    "군포시": [
		        "금정동", "군포동", "당동", "오금동"
		    ],
		    "김포시": [
		        "김포읍", "풍무동", "사우동", "장기동", "고촌면", "월곶면"
		    ],
		    "남양주시": [
		        "별내동", "화도읍", "금곡동", "진건읍", "다산동", "호평동"
		    ],
		    "동두천시": [
		        "동두천동", "상봉동", "연천군"
		    ],
		    "부천시": [
		        "상동", "소사동", "중동", "오정동", "심곡동"
		    ],
		    "북동천시": [
		        "부천동", "덕산동", "송내동"
		    ],
		    "성남시": [
		        "수정구", "중원구", "분당구"
		    ],
		    "수원시": [
		        "장안구", "권선구", "팔달구", "영통구"
		    ],
		    "시흥시": [
		        "정왕동", "군자동", "월곶동", "연성동", "배곧동"
		    ],
		    "안산시": [
		        "상록구", "단원구"
		    ],
		    "안성시": [
		        "안성읍", "공도읍", "고삼면", "일죽면", "죽산면"
		    ],
		    "안양시": [
		        "만안구", "동안구"
		    ],
		    "양주시": [
		        "양주읍", "회천동", "옥정동", "광적면"
		    ],
		    "양평군": [
		        "양평읍", "지평면", "서종면", "개군면"
		    ],
		    "여주시": [
		        "여주읍", "능서면", "가남읍", "흥천면"
		    ],
		    "연천군": [
		        "연천읍", "청산면", "백학면", "임진면", "강상면"
		    ],
		    "오산시": [
		        "오산동", "궐동", "수청동"
		    ],
		    "용인시": [
		        "기흥구", "수지구", "처인구"
		    ],
		    "의왕시": [
		        "고천동", "내손동", "오전동"
		    ],
		    "의정부시": [
		        "민락동", "가능동", "의정부동", "장암동"
		    ],
		    "이천시": [
		        "이천읍", "송정동", "진사동", "대월면"
		    ],
		    "파주시": [
		        "파주읍", "교하동", "문산읍"
		    ],
		    "평택시": [
		        "평택동", "동두천동", "합정동", "하나로동"
		    ],
		    "하남시": [
		        "하남읍", "감북동", "덕풍동", "천호동"
		    ],
		    "화성시": [
		        "화성읍", "봉담읍", "향남읍", "송산면"
		    ]
	},
    "강원도": {
		"강릉시": [
		        "강동", "교동", "구정면", "남평동", "내곡동", "동부동", "동해면", "송정동", "송현동", "수동", 
		        "옥계면", "주문진읍", "중앙동", "포남동", "홍제동"
		    ],
		    "고성군": [
		        "거진읍", "구산면", "토성면", "간성읍", "현내면", "청간면", "죽왕면", "수동면", "동해면"
		    ],
		    "동해시": [
		        "발한동", "북평동", "시가지", "천곡동", "어달동", "삼화동", "도동", "용정동"
		    ],
		    "삼척시": [
		        "도계읍", "교동", "근덕면", "미로면", "동해면", "신기면", "평기면", "옥곡면", "안흥동"
		    ],
		    "속초시": [
		        "교동", "조양동", "영랑동", "대포동", "청호동", "노학동", "동명동"
		    ],
		    "양구군": [
		        "양구읍", "해안면", "남면", "광석면", "도촌면", "내촌면", "고성면", "서면", "무릉도원"
		    ],
		    "양양군": [
		        "강현면", "양양읍", "현남면", "강릉면", "남애면", "손양면", "천진면", "죽림면"
		    ],
		    "영월군": [
		        "영월읍", "중동면", "한반도면", "상동면", "북면", "무릉도원", "동면"
		    ],
		    "원주시": [
		        "중앙동", "단계동", "행구동", "태장동", "관설동", "반곡동", "명륜동", "북평동", "서원동"
		    ],
		    "인제군": [
		        "인제읍", "북면", "남면", "서면", "북일면", "서일면", "하상면"
		    ],
		    "정선군": [
		        "정선읍", "고한읍", "사북면", "남면", "북면", "북평면", "평창면", "평창리"
		    ],
		    "철원군": [
		        "철원읍", "서면", "북면", "동면", "남면", "근남면", "온정면", "양지면"
		    ],
		    "춘천시": [
		        "석사동", "중앙로", "효자동", "남산면", "신북면", "상천면", "소양면", "동산면"
		    ],
		    "태백시": [
		        "황지동", "춘천동", "당동", "구문동", "삼탄동", "조양동", "토속동"
		    ],
		    "평창군": [
		        "평창읍", "대관령면", "미시령면", "중앙동", "태백동", "영북면", "평택면"
		    ],
		    "홍천군": [
		        "홍천읍", "내면", "동면", "서면", "남면", "가리왕면", "팔마면", "강촌면"
		    ],
		    "화천군": [
		        "화천읍", "중산면", "춘천면", "온천면", "계곡면", "진동면"
		    ]
	},
    "충청북도": {
		"괴산군": [
		        "괴산읍", "불정면", "장연면", "연풍면", "사리면", "청천면", "소수면", "강외면"
		    ],
		    "단양군": [
		        "단양읍", "대강면", "가곡면", "매포읍", "영춘면", "수양면", "적성면", "하소면"
		    ],
		    "보은군": [
		        "보은읍", "회남면", "회인면", "오산면", "마로면", "내북면", "삼승면"
		    ],
		    "영동군": [
		        "영동읍", "용산면", "매곡면", "양산면", "강천면", "하소면", "평촌면"
		    ],
		    "옥천군": [
		        "옥천읍", "청산면", "안남면", "동이면", "이원면", "군서면", "하리면"
		    ],
		    "음성군": [
		        "음성읍", "대소면", "금왕읍", "삼성면", "원남면", "소이면"
		    ],
		    "제천시": [
		        "제천읍", "봉양읍", "고암면", "수산면", "매포읍", "읍천동", "의림지"
		    ],
		    "진천군": [
		        "진천읍", "덕산면", "문백면", "상산면", "초평면", "삼수면", "충북음성"
		    ],
		    "청원구": [
		        "청원구청", "청주시", "청운면", "장재면", "청원읍", "상당동", "송정동"
		    ],
		    "충주시": [
		        "충주시", "호암면", "대소면", "서산면", "금강면", "온금면", "문경면", "거마면"
		    ]
	},
    "충청남도": {
		"계룡시": [
		        "계룡읍", "두마면", "엄사면", "신도안면"
		    ],
		    "공주시": [
		        "공주시", "이인면", "신관면", "금학동", "웅진동", "중앙동", "탄천면"
		    ],
		    "금산군": [
		        "금산읍", "복수면", "남일면", "군북면", "부리면", "진산면", "하의면"
		    ],
		    "논산시": [
		        "논산읍", "연무읍", "상월면", "강경읍", "취암동", "문지면"
		    ],
		    "당진시": [
		        "당진읍", "송악읍", "합덕읍", "석문면", "고대면", "순성면", "북도면"
		    ],
		    "보령시": [
		        "보령읍", "대천동", "주교동", "웅천동", "청라면", "영동면"
		    ],
		    "부여군": [
		        "부여읍", "규암면", "장암면", "외산면", "석성면", "직산면"
		    ],
		    "서산시": [
		        "서산읍", "음암면", "지곡면", "대산읍", "부춘동", "팔봉면"
		    ],
		    "서천군": [
		        "서천읍", "장항읍", "마서면", "비인면", "문산면", "임성면"
		    ],
		    "아산시": [
		        "아산읍", "탕정면", "신창면", "염치읍", "음봉면", "배방읍"
		    ],
		    "예산군": [
		        "예산읍", "삽교읍", "고덕면", "덕산면", "대술면", "광시면", "조치원읍"
		    ],
		    "천안시": [
		        "천안읍", "동남구", "서북구", "성환읍", "입장면", "병천면", "풍세면"
		    ],
		    "청양군": [
		        "청양읍", "남양면", "장평면", "비봉면", "운곡면", "청송면"
		    ],
		    "태안군": [
		        "태안읍", "근흥면", "소원면", "안면읍", "남면", "북면"
		    ],
		    "홍성군": [
		        "홍성읍", "광천읍", "결성면", "서부면", "마서면", "임진면"
		    ]			
	},
    "전라북도": {
		"고창군": [
		        "고창읍", "상하농공단지", "성송면", "풍천면", "읍동", "상천면"
		    ],
		    "군산시": [
		        "군산읍", "미장동", "고산동", "미곡동", "삼학동", "아산동", "월명동"
		    ],
		    "김제시": [
		        "김제읍", "죽전면", "합덕면", "월산면", "향교면", "성덕면"
		    ],
		    "남원시": [
		        "남원읍", "춘향로", "양정동", "도천동", "망상동", "강동면"
		    ],
		    "무주군": [
		        "무주읍", "용진면", "부안면", "안성면", "우양면", "안곡면"
		    ],
		    "부안군": [
		        "부안읍", "조차면", "곰실면", "사운면", "하정면", "태진면"
		    ],
		    "순창군": [
		        "순창읍", "강선면", "천천면", "정해면", "운정면", "좌항면"
		    ],
		    "완주군": [
		        "완주읍", "고산면", "경천면", "삼례면", "이서면", "이춘면"
		    ],
		    "익산시": [
		        "익산읍", "정읍동", "고리동", "개동", "삼성동", "기지동", "원리동"
		    ],
		    "임실군": [
		        "임실읍", "장수면", "명평면", "평상면", "덕유면", "전주면"
		    ],
		    "장수군": [
		        "장수읍", "운정면", "청양면", "산수면", "태성면", "예안면"
		    ],
		    "전주시": [
		        "전주읍", "평화동", "유덕동", "동운동", "전동", "송천동", "풍암동"
		    ],
		    "정읍시": [
		        "정읍읍", "우렁길", "강남동", "상무로", "서고동", "동부동"
		    ],
		    "진안군": [
		        "진안읍", "용담면", "동향면", "고정면", "진룡면", "주곡면"
		    ]
	},
    "전라남도": {
		"강진군": [
		        "강진읍", "군동면", "도암면", "마량면", "성전면", "옥상면"
		    ],
		    "고흥군": [
		        "고흥읍", "과역면", "동강면", "도양읍", "분청면", "봉림면"
		    ],
		    "광양시": [
		        "광양읍", "금호동", "진월동", "옥곡면", "해양동", "두암동"
		    ],
		    "구례군": [
		        "구례읍", "광의면", "마산면", "문정면", "산동면", "상등면"
		    ],
		    "나주시": [
		        "나주읍", "산포면", "동강면", "금천면", "세지면", "우수면"
		    ],
		    "담양군": [
		        "담양읍", "고서면", "대덕면", "봉산면", "삼계면", "용면"
		    ],
		    "도초도": [
		        "도초면", "송월리", "고도리"
		    ],
		    "목포시": [
		        "목포읍", "부흥동", "옥암동", "항동", "용당동", "서흥면"
		    ],
		    "무안군": [
		        "무안읍", "삼향면", "몽탄면", "청계면", "현경면", "오룡면"
		    ],
		    "보성군": [
		        "보성읍", "복내면", "율포면", "겸백면", "웅치면", "벌교면"
		    ],
		    "순천시": [
		        "순천읍", "조곡동", "황전동", "해룡면", "매곡동", "삼산동"
		    ],
		    "신안군": [
		        "목포시", "압해면", "신의면", "반월면", "증도면", "자은면"
		    ],
		    "여수시": [
		        "여수읍", "고흥면", "한경면", "삼천포면", "덕양동", "한려동"
		    ],
		    "영광군": [
		        "영광읍", "백수면", "불갑면", "홍농면", "영해면", "영일면"
		    ],
		    "영암군": [
		        "영암읍", "삼호읍", "남면", "서호면", "금정면", "월출면"
		    ],
		    "완도군": [
		        "완도읍", "금당면", "고산면", "소안면", "청산면", "동명면"
		    ],
		    "장성군": [
		        "장성읍", "삼계면", "북면", "동부면", "황룡면", "서부면"
		    ],
		    "장흥군": [
		        "장흥읍", "보성면", "동복면", "현포면", "관산면", "중동면"
		    ],
		    "진도군": [
		        "진도읍", "고군면", "의신면", "군내면", "임회면", "조도면"
		    ],
		    "함평군": [
		        "함평읍", "나산면", "손불면", "학교면", "임호면", "대동면"
		    ],
		    "해남군": [
		        "해남읍", "북평면", "문내면", "현산면", "삼산면", "마산면"
		    ]
	},
    "경상북도": {
		"경산시": [
		        "경산읍", "압량읍", "자인면", "중방동", "하양읍", "조영동", "옥곡동"
		    ],
		    "경주시": [
		        "경주읍", "보덕동", "천북면", "황남동", "성건동", "동천동", "월성동"
		    ],
		    "고령군": [
		        "고령읍", "개진면", "성산면", "월산면", "쌍림면", "입암면"
		    ],
		    "구미시": [
		        "구미읍", "봉곡동", "형곡동", "인동", "원평동", "삼계동", "신평동"
		    ],
		    "군위군": [
		        "군위읍", "고로면", "소보면", "효령면", "신기면", "삼국면"
		    ],
		    "김천시": [
		        "김천읍", "대항면", "지례면", "대덕면", "아포면", "구미동"
		    ],
		    "문경시": [
		        "문경읍", "산북면", "동로면", "점촌동", "가은면"
		    ],
		    "봉화군": [
		        "봉화읍", "석포면", "춘양면", "명호면", "재산면", "청량면"
		    ],
		    "상주시": [
		        "상주읍", "이안면", "외서면", "모동면", "청리면", "중동면"
		    ],
		    "성주군": [
		        "성주읍", "가천면", "용암면", "대흥면", "수륜면", "벽진면"
		    ],
		    "안동시": [
		        "안동읍", "도산면", "임하면", "풍산읍", "태화동", "지례면"
		    ],
		    "영덕군": [
		        "영덕읍", "영해면", "지품면", "강구면", "남정면", "창수면"
		    ],
		    "영양군": [
		        "영양읍", "일월면", "청기면", "석보면", "입암면", "부동면"
		    ],
		    "영주시": [
		        "영주읍", "이산면", "상망면", "문수면", "조치면", "송림동"
		    ],
		    "영천시": [
		        "영천읍", "화북면", "대창면", "임고면", "고경면", "청통면"
		    ],
		    "예천군": [
		        "예천읍", "용문면", "보문면", "호명면", "풍양면", "내신면"
		    ],
		    "울릉군": [
		        "울릉읍", "서면", "남면", "북면", "읍면"
		    ],
		    "울진군": [
		        "울진읍", "기성면", "후포면", "매화면", "근남면", "죽변면"
		    ],
		    "의성군": [
		        "의성읍", "가음면", "금성면", "봉양면", "단밀면", "춘산면"
		    ],
		    "청도군": [
		        "청도읍", "각북면", "각남면", "고수면", "화양읍", "풍각면"
		    ],
		    "청송군": [
		        "청송읍", "부동면", "주왕산면", "현동면", "진보면", "유네면"
		    ],
		    "칠곡군": [
		        "칠곡읍", "지천면", "기산면", "북삼읍", "왜관읍", "북산면"
		    ],
		    "포항시": [
		        "포항읍", "북구", "남구", "울릉면", "영일만", "대송면", "효자동"
		    ]
	},
    "경상남도": {
		"거제시": [
		        "거제읍", "아주동", "둔덕면", "사등면", "하청면", "장목면", "서면", "동부면", "고현동"
		    ],
		    "거창군": [
		        "거창읍", "웅양면", "남상면", "북상면", "합천면", "용산면", "고제면", "주상면"
		    ],
		    "고성군": [
		        "고성읍", "상리면", "하이면", "삼산면", "포산면", "대가면", "일광면"
		    ],
		    "김해시": [
		        "김해읍", "내동", "외동", "진례면", "한림면", "부원동", "진영읍", "장유면"
		    ],
		    "남해군": [
		        "남해읍", "미조면", "삼동면", "삼천포면", "상주면", "고천면"
		    ],
		    "밀양시": [
		        "밀양읍", "내이동", "가곡면", "하남면", "무안면", "단장면", "삼랑진읍", "산내면"
		    ],
		    "사천시": [
		        "사천읍", "정동면", "용현면", "용당동", "남양면", "선구동", "곡선면"
		    ],
		    "산청군": [
		        "산청읍", "신안면", "차황면", "삼장면", "단성면", "차현면", "영남면", "금서면"
		    ],
		    "양산시": [
		        "양산읍", "물금읍", "소주동", "서상동", "평산동", "동면", "북정동"
		    ],
		    "의령군": [
		        "의령읍", "궁내면", "함안면", "신사면", "고당면", "불로면"
		    ],
		    "진주시": [
		        "진주읍", "가좌동", "중앙동", "대곡면", "금산면", "내곡면", "문산읍", "칠암동"
		    ],
		    "창녕군": [
		        "창녕읍", "영산면", "남지면", "동읍", "의성면", "고성면"
		    ],
		    "창원시": [
		        "창원읍", "마산회원구", "마산합포구", "진해구", "의창구", "성산구", "구암동", "팔용동"
		    ],
		    "통영시": [
		        "통영읍", "도산면", "한산면", "사천시", "미륵산면", "안강면"
		    ],
		    "하동군": [
		        "하동읍", "고전면", "금남면", "고흥면", "장성면", "군포면"
		    ],
		    "함안군": [
		        "함안읍", "북면", "산인면", "진성면", "화정면", "음덕면", "유보면"
		    ],
		    "함양군": [
		        "함양읍", "마천면", "유림면", "상림면", "서하면", "위천면"
		    ],
		    "합천군": [
		        "합천읍", "동면", "삼가면", "호계면", "창촌면", "초계면", "북산면"
		    ]
	},
    "제주도": {
		"제주시": [
		        "이도이동", "이도이동", "아라동", "연동", "노형동", "용담1동", "용담2동", "삼도1동",
		        "삼도2동", "오라동", "애월읍", "한림읍", "조천읍", "구좌읍", "성산읍", "표선면",
		        "남원읍", "대정읍", "안덕면", "한경면"
		    ],
		    "서귀포시": [
		        "서귀동", "중문동", "동홍동", "대천동", "태평동", "법환동", "남원읍", "성산읍",
		        "표선면", "효돈동", "안덕면", "대정읍", "한경면"
		    ]
	}
};